src/DataProcessors/КИИ_НастройкиКонтроляПерсональныхДанных/КИИ_НастройкиКонтроляПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КИИ_НастройкиКонтроляПерсональныхДанных</name>
</mdclass:DataProcessor>

src/InformationRegisters/КИИ_ЖурналКонтроляПерсональныхДанных/КИИ_ЖурналКонтроляПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_ЖурналКонтроляПерсональныхДанных</name>
  <resources>
    <name>Момент</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Канал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КИИ_МоделиИИ</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Режим</name>
    <type>
      <types>EnumRef.КИИ_РежимыКонтроляПерсональныхДанных</types>
    </type>
  </resources>
  <resources>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОтказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипыСущностей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗамен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БылиЗамены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияГенератораПодстановок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВосстановления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьМиллисекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусАудита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_РежимыКонтроляПерсональныхДанных/КИИ_РежимыКонтроляПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_РежимыКонтроляПерсональныхДанных</name>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
  <enumValues>
    <name>Логировать</name>
  </enumValues>
  <enumValues>
    <name>Маскировать</name>
  </enumValues>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/КИИ_НастройкиКонтроляПерсональныхДанных/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗагрузитьНастройки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)

	ТекстОшибки = СохранитьНаСервере();
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;

	ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки контроля персональных данных сохранены'"));

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТекст(Команда)

	ПроверитьТекстНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)

	ОткрытьФорму("РегистрСведений.КИИ_ЖурналКонтроляПерсональныхДанных.ФормаСписка");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройки()

	Режимы = Перечисления.КИИ_РежимыКонтроляПерсональныхДанных;

	// Пустая константа означает режим канала по умолчанию: форма показывает его явно.
	РежимЗапросовКМоделям = ЗначениеИлиПоУмолчанию(
		Константы.КИИ_РежимКонтроляЗапросовКМоделям.Получить(), Режимы.Маскировать);
	РежимУведомленийТелеграм = ЗначениеИлиПоУмолчанию(
		Константы.КИИ_РежимКонтроляУведомленийТелеграм.Получить(), Режимы.Маскировать);
	РежимРендераДиаграмм = ЗначениеИлиПоУмолчанию(
		Константы.КИИ_РежимКонтроляРендераДиаграмм.Получить(), Режимы.Логировать);
	РендерДиаграммДоверенный = Константы.КИИ_РендерДиаграммДоверенный.Получить();

	СрокХраненияСобытий = Константы.КИИ_СрокХраненияСобытийКонтроля.Получить();
	Если СрокХраненияСобытий <= 0 Тогда
		СрокХраненияСобытий = 30;
	КонецЕсли;

	Включенные = Новый Массив;
	Для Каждого Элемент Из СтрРазделить(ВРег(Константы.КИИ_ВключенныеПравилаПерсональныхДанных.Получить()), ",", Ложь) Цикл
		Включенные.Добавить(СокрЛП(Элемент));
	КонецЦикла;

	// Пустая настройка включает все правила, как и в модуле контроля.
	Для Каждого Правило Из РеквизитыПравил() Цикл
		ЭтотОбъект[Правило.Значение] = Включенные.Количество() = 0 Или Включенные.Найти(Правило.Ключ) <> Неопределено;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере()

	Включенные = Новый Массив;
	Для Каждого Правило Из РеквизитыПравил() Цикл
		Если ЭтотОбъект[Правило.Значение] Тогда
			Включенные.Добавить(Правило.Ключ);
		КонецЕсли;
	КонецЦикла;

	Если Включенные.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Нельзя выключить все правила: пустой список означает «все включены».
			|Чтобы не проверять канал, выберите для него режим «Выключен».'");
	КонецЕсли;

	// Все правила включены - хранится пустая строка: новые правила следующих версий включатся сами.
	СтрокаПравил = ?(Включенные.Количество() = РеквизитыПравил().Количество(), "", СтрСоединить(Включенные, ","));

	НачатьТранзакцию();
	Попытка
		Константы.КИИ_РежимКонтроляЗапросовКМоделям.Установить(РежимЗапросовКМоделям);
		Константы.КИИ_РежимКонтроляУведомленийТелеграм.Установить(РежимУведомленийТелеграм);
		Константы.КИИ_РежимКонтроляРендераДиаграмм.Установить(РежимРендераДиаграмм);
		Константы.КИИ_РендерДиаграммДоверенный.Установить(РендерДиаграммДоверенный);
		Константы.КИИ_СрокХраненияСобытийКонтроля.Установить(СрокХраненияСобытий);
		Константы.КИИ_ВключенныеПравилаПерсональныхДанных.Установить(СтрокаПравил);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат "";

КонецФункции

// Показывает, что найдут сохраненные правила и как текст уйдет в режиме «Маскировать».
// Ничего не отправляет и в журнал не пишет.
&НаСервере
Процедура ПроверитьТекстНаСервере()

	Проверка = КИИ_КонтрольПерсональныхДанных.ПроверитьТекст(ПроверяемыйТекст);

	Строки = Новый Массив;
	Если Проверка.Находки.Количество() = 0 Тогда
		Строки.Добавить(НСтр("ru = 'Персональных данных не найдено.'"));
	КонецЕсли;
	Для Каждого Находка Из Проверка.Находки Цикл
		Шаблон = НСтр("ru = '%1: %2 → %3 (уверенность: %4)'");
		Уверенность = НРег(Находка.Уверенность);
		Строки.Добавить(СтрШаблон(Шаблон, Находка.Тип, Находка.Значение, Находка.Подстановка, Уверенность));
	КонецЦикла;
	Строки.Добавить("");
	Строки.Добавить(НСтр("ru = 'В режиме «Маскировать» уйдет:'"));
	Строки.Добавить(Проверка.ТекстПослеЗамены);

	РезультатПроверки = СтрСоединить(Строки, Символы.ПС);

КонецПроцедуры

// Код правила -> имя реквизита формы с флажком.
&НаСервереБезКонтекста
Функция РеквизитыПравил()

	Правила = Новый Соответствие;
	Правила.Вставить("ФИО", "ПравилоФИО");
	Правила.Вставить("ИНН", "ПравилоИНН");
	Правила.Вставить("СНИЛС", "ПравилоСНИЛС");
	Правила.Вставить("КАРТА", "ПравилоКарта");
	Правила.Вставить("ПАСПОРТ", "ПравилоПаспорт");
	Правила.Вставить("EMAIL", "ПравилоПочта");
	Правила.Вставить("ТЕЛЕФОН", "ПравилоТелефон");

	Возврат Правила;

КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеИлиПоУмолчанию(Знач Значение, Знач ПоУмолчанию)

	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ПоУмолчанию);

КонецФункции

#КонецОбласти
